freelance/app/controllers/apis_controller.rb

  def create
    client_access_code = Client.find_by(access_code: params[:access_code])
---
SELECT "clients".* FROM "clients" WHERE "clients"."access_code" = ? LIMIT ?  [["access_code", "KPKFATEN"], ["LIMIT", 1]]