freelance/app/controllers/registrations_controller.rb

INSERT INTO "freelancers" ("eth_nonce", "eth_address", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?, ?)  [["eth_nonce", "d8aaa118-efb5-4a59-8200-c4e63f4e7693"], ["eth_address", ""], ["created_at", "2023-04-16 15:12:10.079798"], ["updated_at", "2023-04-16 15:12:10.079798"], ["email", "pedro@shift.com"]]
---
  def create
    # only proceed with pretty names
    ActiveRecord::Base.transaction do
      @user = Freelancer.create(freelancer_params)