freelance/app/controllers/sessions_controller.rb

  def create
    # users are indexed by eth address here
    user = Freelancer.find_by(eth_address: params[:eth_address])
---
SELECT "freelancers".* FROM "freelancers" WHERE "freelancers"."eth_address" IS NULL LIMIT ?  [["LIMIT", 1]]