freelance/app/services/create_client_service.rb

  def call
    client = Client.new(params)
    client.freelancer = freelancer
    raise CreateClientServiceError unless client.save
---
INSERT INTO "clients" ("name", "freelancer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Teste"], ["freelancer_id", 1], ["created_at", "2023-04-16 13:03:24.658854"], ["updated_at", "2023-04-16 13:03:24.658854"]]