freelance/app/controllers/api/v1/users_controller.rb

SELECT "freelancers".* FROM "freelancers" WHERE "freelancers"."eth_address" = ? LIMIT ?  [["eth_address", "0xea0c457ae444a31c5747dbb3276b3b9aa3dc1d50"], ["LIMIT", 1]]
---
  def show
    user = nil
    response = nil

    # checks the parameter is a valid eth address
    params_address = Eth::Address.new params[:id]
    if params_address.valid?

      # finds user by valid eth address (downcase to prevent checksum mismatches)
      user = Freelancer.find_by(eth_address: params[:id].downcase)