app/views/clients/index.html.erb

    <div class="col">
      <h3><%= current_freelancer.clients.size %> Clients</h3>
---
SELECT COUNT(*) FROM "clients" WHERE "clients"."freelancer_id" = ?  [["freelancer_id", 1]]

  <tbody>
    <% current_freelancer.clients.each do |client|%>
---
SELECT "clients".* FROM "clients" WHERE "clients"."freelancer_id" = ?  [["freelancer_id", 1]]