app/views/clients/partials/_table_row.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."client_id" = ?  [["client_id", 1]]
---
  <div class="col">
    <span><%= client.finalised_projects.size.to_s + " " + "Project".pluralize(client.finalised_projects.size) + " finalised" %></span>